;Place localized text in this file
;Use the same localization as the advent shield bearer.
[XComEnergyShield X2AbilityTemplate]
LocFriendlyName="Generate Energy Shield"
LocLongDescription="The Shieldbearer can generate an energy shield to protect all nearby allies. The shields will collapse if this unit is killed."
LocHelpText="Project an energy shield around nearby allies and yourself."
LocFlyOverText="Energy Shield"

[XES_EnergyShield X2EquipmentTemplate]
FriendlyName="Energy Shield Generator"
FriendlyNamePlural="Energy Shield Generators"
;BriefSummary="The Energy Shield Generator uses Advent Technology recovered from their Shieldbearers to create a weaker but longer lasting version of their protective shields for XCom's squad in the field."
;TacticalText="<Bullet/> The Energy Shield Generator can provide <Ability:ENERGY_SHIELD_HP/>HP to all soldiers in range and line of sight in the form of a temporary shield.\n<Bullet/> The Energy shield will expire either after <Ability:ENERGY_SHIELD_DURATION_TEXT> turns or after absorbing the <Ability:ENERGY_SHIELD_HP/> damage.\n"
BriefSummary="The Energy Shield Generator uses Advent Technology recovered from their Shieldbearers to create a weaker but longer lasting version of their protective shields for XCom's squad in the field."
TacticalText="<Bullet/> The Energy Shield Generator can provide a 2HP shield to all soldiers in range and line of sight.\n<Bullet/> The Energy shield will expire either after 6 turns or after absorbing the full 2 damage.\n"